In [1]:
import pandas as pd

### Q1. List any five functions of the pandas library with execution.

read_csv: This function is used to read a CSV (Comma Separated Values) file into a pandas DataFrame.

In [2]:
df = pd.read_csv('./items.csv')

info: This function is used to get information about the DataFrame such as data types and memory usage.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   item_name   4622 non-null   object
 1   item_price  4572 non-null   object
dtypes: object(2)
memory usage: 72.3+ KB

describe: This function is used to get summary statistics for the DataFrame such as count, mean, standard deviation, minimum and maximum values.

In [4]:
df.describe()

           item_name item_price
count           4622       4572
unique            50         78
top     Chicken Bowl     $8.75
freq             726        724

head() displays the first n rows of a DataFrame (by default n=5)

In [5]:
df.head()

                               item_name item_price
0           Chips and Fresh Tomato Salsa     $2.39
1                                   Izze     $3.39
2                       Nantucket Nectar     $3.39
3  Chips and Tomatillo-Green Chili Salsa     $2.39
4                           Chicken Bowl    $16.98

tail() displays the last n rows of a DataFrame (by default n=5).

In [6]:
df.tail()

               item_name item_price
4617       Steak Burrito    $11.75
4618       Steak Burrito    $11.75
4619  Chicken Salad Bowl    $11.25
4620  Chicken Salad Bowl     $8.75
4621  Chicken Salad Bowl     $8.75

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
dic = {

    'A': [1,3,5,7],
    'B': [2.4,3.3,2.4,6.3],
    'C': [True,False,True,False]
}


df = pd.DataFrame(dic)

In [8]:
def reIndexing(df):
    new_index = range(1, 2*len(df)+1, 2)
    df = df.reindex(new_index)
    return df




new_indexed_df = reIndexing(df)
print(new_indexed_df)

     A    B      C
1  3.0  3.3  False
3  7.0  6.3  False
5  NaN  NaN    NaN
7  NaN  NaN    NaN

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [9]:

df['Values'] = [6,4,3,2]

In [10]:
df

   A    B      C  Values
0  1  2.4   True       6
1  3  3.3  False       4
2  5  2.4   True       3
3  7  6.3  False       2

In [11]:
def print3values(df):
    total=0
    for i in df['Values'][0:3]:
        total+=i
    
    print(total)
    
    

print3values(df)

13

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
df['Text'] = ['plane','Roar','Lady','air']

In [13]:
df

   A    B      C  Values   Text
0  1  2.4   True       6  plane
1  3  3.3  False       4   Roar
2  5  2.4   True       3   Lady
3  7  6.3  False       2    air

In [14]:
def countwordscol(df):
    wordcount = []
    for i in df['Text']:
       wordcount.append(len(i))
    df['Word_Count'] = wordcount
        
countwordscol(df)
df

   A    B      C  Values   Text  Word_Count
0  1  2.4   True       6  plane           5
1  3  3.3  False       4   Roar           4
2  5  2.4   True       3   Lady           4
3  7  6.3  False       2    air           3

### Q5. How are DataFrame.size() and DataFrame.shape() different?

The DataFrame.size attribute and the DataFrame.shape attribute both provide information about the dimensions of a Pandas DataFrame, but they are calculated differently.

**DataFrame.size** returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns. For example, if a DataFrame has 3 rows and 4 columns, DataFrame.size will return 12.

**DataFrame.shape** returns a tuple representing the dimensions of the DataFrame in the form (number of rows, number of columns). For example, if a DataFrame has 3 rows and 4 columns, DataFrame.shape will return (3, 4).

### Q6. Which function of pandas do we use to read an excel file?

The function in Pandas used to read an Excel file is pandas.read_excel(). This function can read data from both XLS and XLSX file formats.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [16]:
df['Email'] = ['mh@example.com','rasis.can@jmail.com','public.st@smail.com','look.at@hmail.com']

In [30]:
email_list = list(df['Email'])
username_list=[]
for i in email_list:
    username_list.append(i.split('@')[0])
    
print(username_list)

['mh', 'rasis.can', 'public.st', 'look.at']

In [31]:
df['Username'] = username_list

In [32]:
df['Username']

0           mh
1    rasis.can
2    public.st
3      look.at
Name: Username, dtype: object

In [33]:
df

   A    B      C  Values   Text  Word_Count                Email   Username
0  1  2.4   True       6  plane           5       mh@example.com         mh
1  3  3.3  False       4   Roar           4  rasis.can@jmail.com  rasis.can
2  5  2.4   True       3   Lady           4  public.st@smail.com  public.st
3  7  6.3  False       2    air           3    look.at@hmail.com    look.at

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [34]:
df

   A    B      C  Values   Text  Word_Count                Email   Username
0  1  2.4   True       6  plane           5       mh@example.com         mh
1  3  3.3  False       4   Roar           4  rasis.can@jmail.com  rasis.can
2  5  2.4   True       3   Lady           4  public.st@smail.com  public.st
3  7  6.3  False       2    air           3    look.at@hmail.com    look.at

In [47]:
dic = {
    'A':[3,8,6,2,9],
    'B':[5,12,19,13,1],
    'C':[1,7,4,5,2]
}

df = pd.DataFrame(dic)

In [48]:
df

   A   B  C
0  3   5  1
1  8  12  7
2  6  19  4
3  2  13  5
4  9   1  2

In [50]:
def selectrows(df):
    new_df = df[(df['A']>5) & (df['B'] < 10)]
    return new_df



result = selectrows(df)

print(result)
print(type(result))

   A  B  C
4  9  1  2
<class 'pandas.core.frame.DataFrame'>